#Указываем образ который будем использовать в качестве исходного
FROM golang:1.15 AS builder

# Устанавливаем директорию в которой будет происходить сборка
WORKDIR $GOPATH/src/application/

#Копируем файлы содержащие информацию о необходимых пакетах
#На это стоит обратить внимание, мы копируем их отдельно от остального кода чтобы ускорить процесс сборки
COPY go.mod .
COPY go.sum .

#Так как эти файлы меняются значительно реже чем основной код, то команда go mod download 
# будет запускаться не каждый раз а только при изменении go.mod и go.sum
RUN go mod download


#Копируем весь остальной код
COPY . .

#Собираем приложение
RUN CGO_ENABLED=0 GOOS=linux go build -a -installsuffix nocgo -o /app .

CMD ["/app"]
